In [2]:
import numpy as np

In [4]:
import pandas as pd

In [6]:
data = np.random.randn(4,3)

In [8]:
data

array([[ 1.25785449, -1.42643445,  0.31338395],
       [ 1.24688665,  1.73455978, -3.96414067],
       [-2.06002753,  1.03256462, -0.55226968],
       [-0.36161012, -0.10398709, -0.13433857]])

In [12]:
# data.Series(data)
# AttributeError: 'numpy.ndarray' object has no attribute 'Series'

In [14]:
data_frame=pd.DataFrame(data)

In [16]:
data_frame

          0         1         2
0  1.257854 -1.426434  0.313384
1  1.246887  1.734560 -3.964141
2 -2.060028  1.032565 -0.552270
3 -0.361610 -0.103987 -0.134339

In [18]:
type(data_frame)

pandas.core.frame.DataFrame

In [20]:
type(data_frame[0])

pandas.core.series.Series

In [22]:
new_df = pd.DataFrame(data, index=["Atil", "Zeynep", "Atlas", "Mehmet"], columns=["Salary", "Age", "Seniority"])

In [26]:
new_df

          Salary       Age  Seniority
Atil    1.257854 -1.426434   0.313384
Zeynep  1.246887  1.734560  -3.964141
Atlas  -2.060028  1.032565  -0.552270
Mehmet -0.361610 -0.103987  -0.134339

In [28]:
new_df["Salary"]

Atil      1.257854
Zeynep    1.246887
Atlas    -2.060028
Mehmet   -0.361610
Name: Salary, dtype: float64

In [30]:
new_df[["Salary","Age"]]

          Salary       Age
Atil    1.257854 -1.426434
Zeynep  1.246887  1.734560
Atlas  -2.060028  1.032565
Mehmet -0.361610 -0.103987

In [32]:
new_df.loc["Atil"] # loc: get column with index name

Salary       1.257854
Age         -1.426434
Seniority    0.313384
Name: Atil, dtype: float64

In [36]:
new_df.iloc[0] # iloc: get column with index(i)

Salary       1.257854
Age         -1.426434
Seniority    0.313384
Name: Atil, dtype: float64

In [38]:
new_df

          Salary       Age  Seniority
Atil    1.257854 -1.426434   0.313384
Zeynep  1.246887  1.734560  -3.964141
Atlas  -2.060028  1.032565  -0.552270
Mehmet -0.361610 -0.103987  -0.134339

In [62]:
new_df.iloc[:,0] # : (all row),  0 (0. index column)

Atil      1.257854
Zeynep    1.246887
Atlas    -2.060028
Mehmet   -0.361610
Name: Salary, dtype: float64

In [50]:
new_df.iloc[:,2]

Atil      0.313384
Zeynep   -3.964141
Atlas    -0.552270
Mehmet   -0.134339
Name: Seniority, dtype: float64

In [64]:
new_df["Extra"]=10

In [66]:
new_df

          Salary       Age  Seniority  Extra
Atil    1.257854 -1.426434   0.313384     10
Zeynep  1.246887  1.734560  -3.964141     10
Atlas  -2.060028  1.032565  -0.552270     10
Mehmet -0.361610 -0.103987  -0.134339     10

In [70]:
new_df.drop("Extra", axis=1) # 1: column, 0: row

          Salary       Age  Seniority
Atil    1.257854 -1.426434   0.313384
Zeynep  1.246887  1.734560  -3.964141
Atlas  -2.060028  1.032565  -0.552270
Mehmet -0.361610 -0.103987  -0.134339

In [72]:
new_df # Extra not reel drop

          Salary       Age  Seniority  Extra
Atil    1.257854 -1.426434   0.313384     10
Zeynep  1.246887  1.734560  -3.964141     10
Atlas  -2.060028  1.032565  -0.552270     10
Mehmet -0.361610 -0.103987  -0.134339     10

In [74]:
new_df.drop("Extra", axis=1,inplace=True) # inplace: for reel drop

In [76]:
new_df

          Salary       Age  Seniority
Atil    1.257854 -1.426434   0.313384
Zeynep  1.246887  1.734560  -3.964141
Atlas  -2.060028  1.032565  -0.552270
Mehmet -0.361610 -0.103987  -0.134339

In [78]:
new_df["Mehmet"]=10

In [80]:
new_df

          Salary       Age  Seniority  Mehmet
Atil    1.257854 -1.426434   0.313384      10
Zeynep  1.246887  1.734560  -3.964141      10
Atlas  -2.060028  1.032565  -0.552270      10
Mehmet -0.361610 -0.103987  -0.134339      10

In [82]:
new_df.drop("Mehmet", axis=1,inplace=True)

In [84]:
new_df

          Salary       Age  Seniority
Atil    1.257854 -1.426434   0.313384
Zeynep  1.246887  1.734560  -3.964141
Atlas  -2.060028  1.032565  -0.552270
Mehmet -0.361610 -0.103987  -0.134339

In [88]:
new_df.drop("Mehmet", axis=0)

          Salary       Age  Seniority
Atil    1.257854 -1.426434   0.313384
Zeynep  1.246887  1.734560  -3.964141
Atlas  -2.060028  1.032565  -0.552270

In [90]:
new_df

          Salary       Age  Seniority
Atil    1.257854 -1.426434   0.313384
Zeynep  1.246887  1.734560  -3.964141
Atlas  -2.060028  1.032565  -0.552270
Mehmet -0.361610 -0.103987  -0.134339

In [94]:
new_df.loc["Atlas"]

Salary      -2.060028
Age          1.032565
Seniority   -0.552270
Name: Atlas, dtype: float64

In [96]:
new_df.loc["Atlas"]["Salary"]

-2.0600275347905463

In [98]:
new_df.loc["Atlas","Salary"]

-2.0600275347905463

In [112]:
new_df.loc["Atlas","Salary"]=100

In [114]:
new_df

            Salary       Age  Seniority
Atil      1.257854 -1.426434   0.313384
Zeynep    1.246887  1.734560  -3.964141
Atlas   100.000000  1.032565  -0.552270
Mehmet   -0.361610 -0.103987  -0.134339

In [116]:
new_df>0

        Salary    Age  Seniority
Atil      True  False       True
Zeynep    True   True      False
Atlas     True   True      False
Mehmet   False  False      False

In [118]:
boolean_frame=new_df>0

In [120]:
new_df[boolean_frame]

            Salary       Age  Seniority
Atil      1.257854       NaN   0.313384
Zeynep    1.246887  1.734560        NaN
Atlas   100.000000  1.032565        NaN
Mehmet         NaN       NaN        NaN

In [122]:
new_df[new_df>0]

            Salary       Age  Seniority
Atil      1.257854       NaN   0.313384
Zeynep    1.246887  1.734560        NaN
Atlas   100.000000  1.032565        NaN
Mehmet         NaN       NaN        NaN

In [124]:
new_df[new_df["Salary"]>1]

            Salary       Age  Seniority
Atil      1.257854 -1.426434   0.313384
Zeynep    1.246887  1.734560  -3.964141
Atlas   100.000000  1.032565  -0.552270

In [128]:
new_df

            Salary       Age  Seniority
Atil      1.257854 -1.426434   0.313384
Zeynep    1.246887  1.734560  -3.964141
Atlas   100.000000  1.032565  -0.552270
Mehmet   -0.361610 -0.103987  -0.134339

In [130]:
new_df[new_df["Age"]>0]

            Salary       Age  Seniority
Zeynep    1.246887  1.734560  -3.964141
Atlas   100.000000  1.032565  -0.552270

In [132]:
new_df

            Salary       Age  Seniority
Atil      1.257854 -1.426434   0.313384
Zeynep    1.246887  1.734560  -3.964141
Atlas   100.000000  1.032565  -0.552270
Mehmet   -0.361610 -0.103987  -0.134339

In [138]:
reset_frame=new_df.reset_index()

In [140]:
reset_frame

    index      Salary       Age  Seniority
0    Atil    1.257854 -1.426434   0.313384
1  Zeynep    1.246887  1.734560  -3.964141
2   Atlas  100.000000  1.032565  -0.552270
3  Mehmet   -0.361610 -0.103987  -0.134339

In [146]:
reset_frame.loc[0]

index            Atil
Salary       1.257854
Age         -1.426434
Seniority    0.313384
Name: 0, dtype: object

In [148]:
new_indeces=["Ati","Zey","Atl", "Meh"]

In [150]:
new_df["NewIndex"]=new_indeces

In [152]:
new_df

            Salary       Age  Seniority NewIndex
Atil      1.257854 -1.426434   0.313384      Ati
Zeynep    1.246887  1.734560  -3.964141      Zey
Atlas   100.000000  1.032565  -0.552270      Atl
Mehmet   -0.361610 -0.103987  -0.134339      Meh

In [154]:
new_df.set_index("NewIndex", inplace=True)

In [156]:
new_df

              Salary       Age  Seniority
NewIndex
Ati         1.257854 -1.426434   0.313384
Zey         1.246887  1.734560  -3.964141
Atl       100.000000  1.032565  -0.552270
Meh        -0.361610 -0.103987  -0.134339

In [158]:
new_df.loc["Ati"]

Salary       1.257854
Age         -1.426434
Seniority    0.313384
Name: Ati, dtype: float64

# Multi Index

In [161]:
first_index=["Simpson","Simpson","Simpson", "South Park","South Park","South Park"]

In [163]:
inner_index=["Homer","Bart","Marge", "Cartman","Kenny", "Kyle"]

In [167]:
zipped_index=list(zip(first_index, inner_index))

In [169]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [171]:
zipped_index= pd.MultiIndex.from_tuples(zipped_index)

In [173]:
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [175]:
sample_values=np.ones((6,2))

In [177]:
big_df=pd.DataFrame(sample_values,index=zipped_index, columns=["Age", "Salary"])

In [179]:
big_df

                    Age  Salary
Simpson    Homer    1.0     1.0
           Bart     1.0     1.0
           Marge    1.0     1.0
South Park Cartman  1.0     1.0
           Kenny    1.0     1.0
           Kyle     1.0     1.0

In [181]:
big_df["Age"]

Simpson     Homer      1.0
            Bart       1.0
            Marge      1.0
South Park  Cartman    1.0
            Kenny      1.0
            Kyle       1.0
Name: Age, dtype: float64

In [185]:
#big_df["Homer"] #KeyError: 'Homer'

In [187]:
big_df.loc["Simpson"].loc
["Homer"]

KeyError: 'Simpson'